{
  "phrases": {
    "catchup": {
      "valid": [
        {"phrase": "catch up", "pos": "v"},
        {"phrase": "catch-up", "pos": "n"}
      ],
      "twoWords": "usually",
      "oneWord": "never",
      "hyphenated": "sometimes",
      "notes": "Usually this phrase appears as a verb: “We need to catch up,” “They spent the afternoon catching up.” As a verb, “catch up” is always two words. It can also be used as a noun (“Let’s schedule a catch-up”), such as in the idomatic phrase “playing catch-up.” In this usage the phrase should be hyphenated, but some dictionaries note that this noun can also appear as one word.",
      "illustrations": ["catchup-sm.jpg"]
    },
    "login": {
      "valid": [
        {"phrase": "log in", "pos": "v"},
        {"phrase": "login", "pos": "n"}
      ],
      "twoWords": "usually",
      "oneWord": "sometimes",
      "hyphenated": "never",
      "notes": "In user interfaces, this phrase should almost always appear as a verb: “Log in.” This is because buttons (and menu items) are typically phrased as imperative sentences — they are commands! (Languages other than English have different conventions.) Implicitly, such commands start with “You”: “(You) log in!” We can think of these as commands given to the computer. By this logic, “log in” used in commands such as “Log in with Facebook” appears as a verb, so it must appear as two words. ¶ Login as one word is a noun, so this usage is more rare. An administrator tool may show when users logged in; this would be a list of logins. Similarly, we can talk about users having a hard time completing login, but it would often be more natural to use the verb form, or even the adjective: “The user couldn’t find the log-in page. He couldn’t log in.”",
      "illustrations": []
    },
    "hangout": {
      "valid": [
        {"phrase": "hang out", "pos": "v"},
        {"phrase": "hangout", "pos": "n"}
      ],
      "twoWords": "usually",
      "oneWord": "rarely",
      "hyphenated": "never",
      "notes": "Hanging out, to hang out, to have hung out: They’re verbs! Verb phrases like this always keep their space, so you don’t want “to hangout,” you want “to hang out.” The noun form isn’t as common and it refers to a frequent haunt, a favorite location in which to hang out. “A lot of my favorite hangouts are dives.”",
      "illustrations": []
    },
    "someway": {
      "valid": [
        {"phrase": "some way", "pos": "n"},
        {"phrase": "someway", "pos": "adv"}
      ],
      "twoWords": "usually",
      "oneWord": "rarely",
      "hyphenated": "never",
      "notes": "“There must be some way to tell these two spellings apart.” Indeed, there is a way! “some way” is a noun phrase. You can ask, “Is there a way?” — Yes, there is some way. “Surely, there is some way to do this that does not involve a fax machine.” However, “someway” is an adverb. This means it describes an action. This usage is less common and usually comes at the beginning or end of the sentence: “The couple eventually managed to find peace, someway.” In this form, “someway” is often followed by — or could be replaced by — its twin, “somehow.” “Someway, somehow, I’m going to make my way to New York.”",
      "illustrations": []
    }
  }
}
